<h1>T i m e s t a m p : t i m e и m k t i m </h1>

<h3>Задача 1</h3>
<?php
/*  В ы в е д и т е   т е к у щ е е   в р е м я   в   ф о р м а т е   t i m e s t a m p
*/
//getdate

$data = date('d,m,y');
echo $data;
?>

<h3>Задача 2</h3>
<?php
/* В ы в е д и т е   1   я н в а р я   2 0 2 5   г о д а   в   ф о р м а т е   t i m e s t a m p
*/
$date = date('1,января,2025');
$str = str_replace(",", " ", $date);
echo $str;
?>

<h3>Задача 3</h3>
<?php
/* В ы в е д и т е   3 1   д е к а б р я   т е к у щ е г о   г о д а   в   ф о р м а т е   t i m e s t a m p .
С к р и п т   д о л ж е н   р а б о т а т ь   н е з а в и с и м о   о т   г о д а ,   в   к о т о р о м   о н
з а п у щ е н .
*/
echo date('d F', mktime(0, 0, 0, 12, 31, 0)) . "<br />";
?>

<h3>Задача 4</h3>
<?php
/* Н а й д и т е   к о л и ч е с т в о   с е к у н д ,   п р о ш е д ш и х   с   1 3 : 1 2 : 5 9   1 5 ­ г о   м а р т а
2 0 0 0   г о д а   д о   н а с т о я щ е г о   м о м е н т а .
*/
$d = time();

echo "<hr>";
$date = mktime(13, 12, 59, 03, 15, 2000);
$c = $d - $date;
echo $c;
?>

<h3>Задача 5</h3>
<?php
/* Н а й д и т е   к о л и ч е с т в о   с е к у н д   $ s e c ,   п р о ш е д ш и х   с   7 : 2 3 : 4 8   1 ­ г о
ч и с л а   т е к у щ е г о   м е с я ц а   д о   н а с т о я щ е г о   м о м е н т а .   Н а й д и т е
к о л и ч е с т в о   м и н у т ,   ч а с о в   и   д н е й ,   с о д е р ж а щ и х с я   в   $ s e c   ( н е
о д н о в р е м е н н о ,   а   п о с л е д о в а т е л ь н о :   с н а ч а л а   м и н у т ы ,   п о т о м   ч а с ы   и
т . д . ) .
*/
$d = date('n');
$date1 = mktime(07, 23, 48, $d, 1, 2015);
$date2 = mktime(date('n,d,Y'));
$date = $date2 - $date1;

echo $date . "<br />";//кол-во секунд
$min = $date / 60; //минута
echo $min . "<br />";
$hour = $min / 60;// час
echo $hour . "<br />";
$day = $hour / 24;
echo $day . "<br />";
?>


<h3>Задача 6</h3>
<?php
/*
 *  В ы в е д и т е   н а   э к р а н   т е к у щ и й   г о д ,   д е н ь ,   м е с я ц ,   ч а с ,   м и н у т у ,
с е к у н д у .
 */

echo date("Y") . "<br />";
echo date("d") . "<br />";
echo date("M") . "<br />";
echo date("H") . "<br />";
echo date("i") . "<br />";
echo date("s") . "<br />";



?>


<h3>Задача 7</h3>
<?php
/*  В ы в е д и т е   т е к у щ у ю   д а т у ­ в р е м я   в   ф о р м а т а х   ' 2 0 1 3 ­ 1 2 ­ 3 1 ' ,
' 3 1 . 1 2 . 2 0 1 3 ' ,   ' 3 1 . 1 2 . 1 3 ' ,   ' 1 2 : 5 9 : 5 9 '
*/
echo date('Y-m-d') . "<br />";
echo date('d.m.Y') . "<br />";
echo date('d.m.y') . "<br />";
echo date('h:i:s') . "<br />";

?>


<h3>Задача 8</h3>
<?php
/*  С   п о м о щ ь ю   ф у н к ц и й   m k t i m e   и   d a t e   в ы в е д и т е   1 3   ф е в р а л я   2 0 1 5
г о д а   в   ф о р м а т е   ' 3 1 . 1 2 . 2 0 1 3 ' .
*/
echo date('d,n,Y', mktime(0, 0, 0, 02, 13, 2015));


?>

<h3>Задача 9</h3>
<?php
/* С о з д а й т е   м а с с и в   д н е й   н е д е л и   $ w e e k .   В ы в е д и т е   н а   э к р а н
н а з в а н и е   т е к у щ е г о   д н я   н е д е л и   с   п о м о щ ь ю   м а с с и в а   $ w e e k   и   ф у н к ц и и
d a t e .   У з н а й т е   к а к о й   д е н ь   н е д е л и   б ы л   0 6 . 0 6 . 2 0 0 6 ,   в   в а ш   д е н ь
р о ж д е н и я .
*/
$arr = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday",
        "Sunday"];
foreach ($arr as $value) {
    $b = date('l');
    if ($b == $value) {
        echo $value . "<br />";
    }
}

// День недели 06,06,2006
echo "День недели 06,06,2006 - " . date('l', mktime(0, 0, 0, 06, 06, 2006))
    . "<br />";

//День рождения
echo "День недели 06,10,1990 - " . date('l', mktime(0, 0, 0, 10, 06, 1990));


?>

<h3>Задача 10</h3>
<?php
/* С о з д а й т е   м а с с и в   м е с я ц е в   $ m o n t h .   В ы в е д и т е   н а   э к р а н   н а з в а н и е
т е к у щ е г о   м е с я ц а   с   п о м о щ ь ю   м а с с и в а   $ m o n t h   и   ф у н к ц и и   d a t e
*/
$arr = ["January", "February", "March", "April", "May", "June", "July",
        "August", "September", "October", "November", "December"];
foreach ($arr as $value) {
    $c = date('F');
    if ($c == $value) {
        echo $value;
    }
}

?>

<h3>Задача 11</h3>
<?php
/* Н а й д и т е   н о м е р   т е к у щ е г о   д н я   о т   н а ч а л а   м е с я ц а .

*/

$date1 = date('z', mktime(0, 0, 0, 9, 01, 2015));
$date2 = date('z');
$date = $date2 - $date1 + 1;// +1 для наглядности. т.к отчет идет от 0
echo "Кол-во дней от первого числа месяца -" . $date;

?>


<h3>Задача 12</h3>
<?php
/*Н а й д и т е   к о л и ч е с т в о   д н е й   в   т е к у щ е м   м е с я ц е .   С к р и п т   д о л ж е н
р а б о т а т ь   н е з а в и с и м о   о т   м е с я ц а ,   в   к о т о р о м   о н   з а п у щ е н .
*/

echo date('t', mktime(0, 0, 0, 06, 05, 2016));

?>