<h1>Работа с регистром символов</h1>
<h3>Задача 1</h3>
<?php
// Д а н а   с т р о к а   ' П р и в е т ,   м и р ! ' .   С д е л а й т е   и з   н е е   с т р о к у   ' П Р И В Е Т
//М И Р ! ' .
$a = "Hello word";
$b = strtoupper($a);
echo $b;
?>

<h3>Задача 2</h3>
<?php
//2 .   Д а н а   с т р о к а   ' P H P ' .   С д е л а й т е   и з   н е е   с т р о к у   ' p h p '
$a = 'PHP';
$b = strtolower($a);
echo $b;
?>

<h3>Задача 3</h3>
<?php
//3 .   Д а н а   с т р о к а   ' м о с к в а ' .   С д е л а й т е   и з   н е е   с т р о к у   ' М о с к в а '
$a = "kiev";
$b = ucfirst($a);
echo $b;
?>


<h3>Задача 4</h3>
<?php
//4 .   Д а н а   с т р о к а   ' М О С К В А ' .   С д е л а й т е   и з   н е е   с т р о к у   ' М о с к в а '
$a = "KIEV";
$b = strtolower($a);
echo $b . "<br />";// Вывод промежуточного результата "киев"
$c = ucfirst($b);
echo $c;
?>

<h3>Задача 5</h3>
<?php
/* Д а н а   с т р о к а   ' и в а н о в   и в а н   и в а н о в и ч ' .
*С д е л а й т е   и з   н е е   с т р о к у
*' И в а н о в   И в а н   И в а н о в и ч '
 */
$a = "Ivanon Ivan Ivanovich";
$b = ucwords($a);
echo $b;
?>

<h3>Задача 6</h3>
<?php
//6 .   Д а н а   с т р о к а   ' я   у ч у   P H P ! ' .   Н а й д и т е
//   к о л и ч е с т в о   с и м в о л о в   в
//э т о й   с т р о к е .
$a = "I teach PHP";
$b = strlen($a);
echo $b;//ответ :11
?>

<h3>Задача 7</h3>
<?php
/*7 .   Д а н а   с т р о к а   ' я   у ч у   P H P ! ' .
 В ы р е ж е т е   и з   н е е   с л о в о   ' у ч у '   и
с л о в о   ' P H P ' .
*/
$a = "Я учу PHP";
$c = "учу";
$d = "PHP";
$b = substr($a, 2, 8);
$y = substr($a, -5, 5);
echo $b . " " . $y;
?>


<h3>Задача 8</h3>
<?php
/* Д а н а   п е р е м е н н а я   $ s t r ,   в   к о т о р о й   х р а н и т с я   к а к о й ­ л и б о   т е к с т .
Р е а л и з у й т е   о б р е з а н и е   д л и н н о г о   т е к с т а   п о   с л е д у ю щ е м у   п р и н ц и п у :
е с л и   к о л и ч е с т в о   с и м в о л о в   э т о г о   т е к с т а   б о л ь ш е   з а д а н н о г о   в
п е р е м е н н о й   $ n ,   т о   в   п е р е м е н н у ю   $ r e s u l t   з а п и ш е м   п е р в ы е   $ n
с и м в о л о в   с т р о к и   $ s t r   и   д о б а в и м   в   к о н е ц   м н о г о т о ч и е   ' . . . ' .   В
п р о т и в н о м   с л у ч а е   в   п е р е м е н н у ю   $ r e s u l t   з а п и ш е м   с о д е р ж и м о е
п е р е м е н н о й   $ s t r
*/
$str = "Challenges for the functions to work with strings";
$n = 25;
$strlen = strlen($str);//49

if ($n !== $strlen) {
    $result = substr($str, 0, $n);// от 0 до $n
    echo $result . "...";
} else {
    $result = $str;
}
?>


<h3>Задача 9</h3>
<?php
/*
 *    Н а п и ш и т е   ф у н к ц и ю ,   к о т о р а я   г е н е р и р у е т   п а р о л ь .   Ф у н к ц и я   д о л ж н а
п р и н и м а т ь   п а р а м е т р .   П а р а м е т р   д о л ж е н   з а д а в а т ь   к о л и ч е с т в о
с и м в о л о в   в   п а р о л е
 */
$pass = "name";
$number = 10;
for ($i = 0; $i < $number; $i++) {
    $p = mt_rand(1, $number);
    $name = $p;
    echo $name;
}
?>

<h3>Задача 10</h3>
<?php
/* С о з д а й т е   п е р е м е н н у ю   $ p a s s w o r d .   П р и с в о й т е   п е р е м е н н о й
$ p a s s w o r d   р е з у л ь т а т   ф у н к ц и и   и з   п р е д ы д у щ е г о   п р и м е р а .   Е с л и
к о л и ч е с т в о   с и м в о л о в   п а р о л я   б о л ь ш е   5 ­ т и   и   м е н ь ш е   1 0 ­ т и ,   т о
в ы в е д и т е   п о л ь з о в а т е л ю   с о о б щ е н и е   о   т о м ,   ч т о   п а р о л ь   п о д х о д и т ,
и н а ч е   с о о б щ е н и е   о   т о м ,   ч т о   н у ж н о   п р и д у м а т ь   д р у г о й   п а р о ль
*/
$password = "nam5";

$number = strlen($password);
if (($number > 5 && $number < 10) == false) {
    echo "Ошибка, введите другой пароль.";
} else {
    for ($i = 0; $i < $number; $i++) {
        $p = mt_rand(1, $number);
        $name = $p;
    }
    echo "Пароль подходит";
}
?>

<h3>Задача 11</h3>
<?php
/*  Н а р и с у й т е   п и р а м и д у ,   к а к   п о к а з а н о   н а   р и с у н к е ,   т о л ь к о   у
в а ш е й   п и р а м и д ы   д о л ж н о   с т о л ь к о   р я д о в ,   ч т о б ы   п о с л е д н и й   э л е м е н т
п и р а м и д к и   с о с т о я л   и з   о д н о г о   с и м в о л а .   П е р в ы й   р я д   п и р а м и д ы
д о л ж е н   х р а н и т с я   в   п е р е м е н н о й   $ s t r   ( м о ж е т   и м е т ь   р а з л и ч н о е
к о л и ч е с т в о   с и м в о л о в ) .   П о д с к а з к а :   в о с п о л ь з у й т е с ь   ф у н к ц и я м и
s t r l e n   и   s u b s t r .

x x x x x x x x x x
x x x x x x x x x
x x x x x x x x
x x x x x x x
x x x x x x
*/

$str = "xxxxxxxxxx";
$count = strlen($str);

for ($i = $count; $i > 0; --$i) {
    if ($i == 10) {
        echo $str . "<br />" . "10" . "</br>";
    } else {
        $substr = substr($str, 1, $i);
        $strlen = strlen($substr);
        echo $substr . "<br />";
        echo $strlen . "<br />";
    }
}
?>

<h3>Задача 12</h3>
<?php
/* Д а н а   с т р о к а   ' Я ­ у ч у ­ P H P ! ' .   З а м е н и т е   в с е   д е ф и с ы   н а   т е г
' < b r > ' .
*/

$a = "Я-учусь-PHP";
$b = "<br />";
$c = str_replace("-", $b, $a);
echo $c;
?>


<hr/>
<h3>Задача 13</h3>
<?php
//  Д а н а   с т р о к а   ' 3 1 . 1 2 . 2 0 1 3 ' .   З а м е н и т е   в с е   т о ч к и   н а   д е ф и с ы
$x = "31.08.2015";
$y = "-";
$j = str_replace(".", $y, $x);
echo $j;
?>

<hr/>
<h3>Задача 14</h3>
<?php
/*
Д а н а   с т р о к а   $ s t r .   З а м е н и т е   с м а й л и к и   ' : ) ' ,   ' : ( ' ,   ' ^ ­ ^ ' ,
к о т о р ы е   в с т р е ч а ю т с я   в   э т о й   с т р о к е   н а   с о о т в е т с в у ю щ и е   к а р т и н к и
( < i m g   s r c = ' ' > ) .
*/
?>
<?php
$a = "':)',':(','^-^'";
$b = explode(",", $a);
$c = [];
if ($b[0]) {

    echo "<img src='smile_1.gif'/>" . "<br />";
}
if ($b[0]) {
    echo "<img src='smile_2.gif'/>" . "<br />";
}
if ($b[0]) {
    echo "<img src='smile_3.gif'/>" . "<br />";
}


?>
<hr/>
<h3>Задача 15</h3>
<?php
/* Д а н а   п е р е м е н н а я   $ s t r ,   в   к о т о р о й   х р а н и т с я   с т р о к а   р у с с к о г о
т е к с т а .   Н а п и ш и т е   с к р и п т ,   к о т о р ы й   з а п и ш е т   т р а н с л и т   э т о г о   т е к с т а
в   п е р е м е н н у ю   $ t r a n s l i t .   Н а п и ш и т е   т а к ж е   с к р и п т ,   к о т о р ы й
в ы п о л н и т   о б р а т н у ю   о п е р а ц и
*/
$str = "Привет, Мир";

$explode = explode(", ", $str);

$tr = [];
if ($explode[0] == "Привет") {
    $tr[0] = "Hello";
}
if ($explode[1] == "Мир") {
    $tr[1] = "Word";
}
$translit = implode(",", $tr);
echo $translit . "!";// Hello,Word!
echo "<br />";

$tr1 = [];
$b = explode(",", $translit);

if ($b[0] == "Hello") {
    $tr1[0] = "Привет";
}
if ($b[1] == "Word") {
    $tr1[1] = "Мир!";
}
$translit1 = implode(",", $tr1);
echo $translit1; //Привет, Мир!
?>

<hr/>
<h3>Задача 16</h3>
<?php
/* Д а н а   с т р о к а   ' я   у ч у   P H P ! ' .   С   п о м о щ ь ю   ф у н к ц и и   e x p l o d e
з а п и ш и т е   к а
 ж д о е   с л о в о   э т о й   с т р о к и   в   о т д е л ь н ы й   э л е м е н т   м а с с и в а .
*/
$a = "Я учу PHP";
$b = explode(" ", $a);
print_r($b);

?>

<hr/>
<h3>Задача 17</h3>
<?php
/* Д а н   м а с с и в   с   э л е м е н т а м и   ' h t m l ' ,   ' c s s ' ,   ' p h p ' ,   ' j s ' .   С
п о м о щ ь ю   ф у н к ц и и   i m p l o d e   с о з д а й т е   с т р о к у   и з   э т и х   э л е м е н т о в ,
р а з д е л е н н ы х   з а п я т ы м
*/
$arr = ["html", "css", "php", "js"];
$a = implode(",", $arr);
echo $a;
?>

<hr/>
<h3>Задача 18</h3>
<?php
/* В   п е р е м е н н о й   $ d a t e   л е ж и т   д а т а   в   ф о р м а т е   ' 2 0 1 3 ­ 1 2 ­ 3 1 ' .
П р е о б р а з у й т е   э т у   д а т у   в   ф о р м а т   ' 3 1 . 1 2 . 2 0 1 3 '
*/
$data = "2014-07-25";
$arr = ['2014', '07', '25'];
$arr1 = ['25', '07', '2014']; // не работает выводит 2014355-045-2014355
$a = str_replace($arr, $arr1, $data);
echo $a;
?>


<hr/>
<h3>Задача 19</h3>
<?php
/* В   п е р е м е н н о й   $ d a t e   л е ж и т   д а т а   в   ф о р м а т е   ' 3 1 . 1 2 . 2 0 1 3 ' .
П р е о б р а з у й т е   э т у   д а т у   в   ф о р м а т   ' 2 0 1 3 ­ 1 2 ­ 3 1
*/
$data = "2013.12.31";
$a = explode(".", $data);
list($a[0], $a[1], $a[2]) = [$a[2], $a[1], $a[0]];
$b = implode("-", $a);
echo $b;
?>


<hr/>
<h3>Задача 20</h3>
<?php
/* Д а н а   с т р о к а   '   p h p   ' .   С д е л а й т е   и з   н е е   3   р а з н ы х   с т р о к и   с
п о м о щ ь ю   ф у н к ц и й   к л а с с а   t r i m :   ' p h p ' ,   '   p h p ' ,   ' p h p   '
*/
$php = "   php   ";
$a = trim($php);
echo "-" . $a . "-" . "<br />";
$b = ltrim($php);
echo "-" . $b . "-" . "<br />";
$c = rtrim($php);
echo "-" . $c . "-" . "<br />";
?>

<hr/>
<h3>Задача 21</h3>
<?php
/* Д а н а   с т р о к а   ' h t m l ,   < b > p h p < / b > ,   j s ' .   У д а л и т е   т е г и   и з   э т о й
с т р о к и .
*/
$a = 'html,<b>php</b>,js';
$b = strip_tags($a);
echo $b;
?>

<hr/>
<h3>Задача 22</h3>
<?php
/* Д а н а   с т р о к а   ' h t m l ,   < b > p h p < / b > ,   j s ' .   В ы в е д и т е   е е   н а   э к р а н
' к а к   е с т ь ' :   т о   е с т ь   б р а у з е р   н е   д о л ж е н   п р е о б р а з о в а т ь   < b >   в
ж и р н ы й .
*/
$a = 'html,<b>php</b>,js';
$b = htmlentities($a);
echo $b;
?>

<hr/>
<h3>Задача 23</h3>
<?php
//2 3 .   У з н а й т е   к о д   с и м в о л о в   ' a ' ,   ' b ' ,   ' c ' ,   п р о б е л а .
// c h r   и   o r d
$a = "a";
$b = "b";
$c = "c";
echo ord($a) . "<br />";
echo ord($b) . "<br />";
echo ord($c) . "<br />";
?>

<hr/>
<h3>Задача 24</h3>
<?php
/* И з у ч и т е   т а б л и ц у   A S C I I .   О п р е д е л и т е   г р а н и ц ы ,   в   к о т о р ы х
р а с п о л а г а ю т с я   б у к в ы   а н г л и й с к о г о   а л ф а в и т а .   В ы в е д и т е   н а   э к р а н
с и м в о л   с   к о д о м   3 3
*/
echo chr(33);
?>

<hr/>
<h3>Задача 25</h3>
<?php
/* З а п и ш и т е   в   п е р е м е н н у ю   $ s t r   с л у ч а й н ы й   с и м в о л   —   б о л ь ш у ю
б у к в у   л а т и н с к о г о   а л ф а в и т а .   П о д с к а з к а :   с   п о м о щ ь ю   т а б л и ц ы   A S C I I
о п р е д е л и т е   к а к и е   ц е л ы е   ч и с л а   с о о т в е т с т в у ю т   б о л ь ш и м   б у к в а м
л а т и н с к о г о   а л ф а в и т а
*/
echo chr(33) . "<br />";
echo chr(99) . "<br />";
echo chr(35) . "<br />";
echo chr(72) . "<br />";
echo chr(33) . "<br />";
echo chr(33) . "<br />";
echo chr(112) . "<br />";
echo chr(25) . "<br />";
echo chr(45) . "<br />";
echo chr(46) . "<br />";
echo chr(53) . "<br />";
echo chr(54) . "<br />";
echo "решение" . "<br />";
$min = 65;
$max = 90;
$str = rand($min, $max);
echo chr($str);
?>

<hr/>
<h3>Задача 26</h3>
<?php
/* З а п и ш и т е   в   п е р е м е н н у ю   $ s t r   с л у ч а й н у ю   с т р о к у   $ l e n   д л и н о й ,
с о с т о я щ у ю   и з   м а л е н ь к и х   б у к в   л а т и н с к о г о   а л ф а в и т а .   П о д с к а з к а :
в о с п о л ь з у й т е с ь   ц и к л о м   f o r   и л и   w h i l e
*/
$length = 20;
$min = 97;
$max = 122;

for ($i = 1; $i < $length; $i++) {
    if (isset($length)) {
        $str = rand($min, $max);
        echo chr($str) . " ";
    }
}
?>

<hr/>
<h3>s u b s t r _ c o u n t , s t r _ w o r d _ c o u n t , s t r _ s p l i
    t</h3>
<h3>Задача 27</h3>
<?php
/*Д а н а   с т р о к а   ' М а м а   м ы л а   р а м у ' .   У з н а й т е   к о л и ч е с т в о   б у к в   ' a '
и   ' м ' ,   в х о д я щ и х   в   э т у   с т р о к у .
*/
$a = "Мама мыла Раму";
$b = substr_count($a, "а");
echo $b;//4
?>

<h3>Задача 28</h3>
<?php
/* С к о п и р у й т е   в е с ь   т е к с т   с о   с т р а н и ц ы   p h p . s u ,   з а п и ш и т е   е г о   в
п е р е м е н н у ю   $ s t r .   П о д с ч и т а й т е   к о л и ч е с т в о   с и м в о л о в   и   к о л и ч е с т в о
с л о в   в   д а н н н о й   с т р о к е
*/
$a
    = " Counts the number of words inside string. If the optional format is
 not specified, then the return value will be an integer representing the
 number of words found. In the event the format is specified, the return value
  will be an array, content of which is dependent on the format. The possible
 ";

$c = str_word_count($a, 0);
echo "Число слов = " . $c . "<br />";//52

$b = strlen($a);
echo "Число букв = " . $b;
?>


<h3>Задача 29</h3>
<?php
/*  С о з д а й т е   м а с с и в   г л а с н ы х   б у к в .   С   п о м о щ ь ю   э т о г о   м а с с и в а
п о д с ч и т а й т е   к о л и ч е с т в о   г л а с н ы х   в   с т р о к е   $ s t r .   Р е з у л ь т а т
п р е д с т а в ь т е   в   в и д е   а с с о ц и а т и в н о г о   м а с с и в а ,   г д е   к л ю ч а м и   б у д у т
б у к в ы ,   а   э л е м е н т а м и   и х   к о л и ч е с т в о
*/
$a = ["a", "e", "i", "o", "u"];

$b = array_flip($a);
print_r($b);
?>

<h3>Задача 30</h3>
<?php
/* Д а н а   с т р о к а   ' 1 2 3 4 5 6 7 8 9 0 ' .   Р а з б е й т е   е е   н а   м а с с и в   с
э л е м е н т а м и   ' 1 2 ' ,   ' 3 4 ' ,   ' 5 6 ' ,   ' 7 8 ' ,   ' 9 0 '
*/
$a = "123457890";
$b = str_split($a, 2);
print_r($b);
?>

<h3>Задача 31</h3>
<?php
/*П р о в е р ь т е ,   я в л я е т с я   л и   п а р а   с л о в   п а л и н д р о м о м   ( о д и н а к о в о
ч и т а е т с я   в о   в с е х   н а п р а в л е н и я х ,   к о т ­ т о к ,   н о с ­ с о н )
*/
$a = "hfh";
$b = strrev($a);
if ($a == $b) {
    echo "Палиндром";
} else {
    echo "Пробуй еще";
}
?>

<h3>Задача 32</h3>
<?php
/* Д а н   м а с с и в   $ a r r .   Н а й д и т е   в   н е м   в с е   п а р ы   с л о в ­ п а л и н д р о м о в
( о д и н а к о в о   ч и т а ю т с я   в о   в с е х   н а п р а в л е н и я х ,   к о т ­ т о к ,   н о с ­ с о н ) .
Р е з у л ь т а т   в ы в о д и т е   в   в и д е   с т р о к а   ф о р м а т а   ' н о с   —   с о н ' .
П р о в е р ь т е   р а б о т у   с к р и п т а   н а   м а с с и в е   $ a r r   и з   п р и м е р а .   С о в е т :
н у ж н о   с д е л а т ь   н е   о д и н ,   а   д в а   ц и к л
*/
$arr = ['slon', 'nos', 'tok', 'tak', 'kot', 'pir', 'mir', 'ara', 'rim'];
foreach ($arr as $value) {
    foreach ($arr as $lom) {
    }
    $lom1 = strrev($lom);
    if ($lom1 == $value) {
        echo "Палиндром - " . $value . " - " . $lom1 . "<br />";
    }
}
?>

<h3>Задача 33</h3>
<?php
/* О п р е д е л и т е   я в л я е т с я   л и   ф р а з а   п а л и н д р о м о м .   П р и м е р ы :   ' A   r o z a
u p a l a   n a   l a p u   A s o r a ' .   О б р а т и т е   в н и м а н и е   н а   т о ,   ч т о   п р и
о б р а т н о м   ч т е н и и   и г н о р и р у ю т с я   п р о б е л ы ,   з а п я т ы е ,   д е ф и с ы ,   т и р е   и
б о л ь ш и е   б у к в ы   ( п о д с к а з к а :   з н а ч и т   с н а ч а л а   н у ж н о   п р и в е с т и   с т р о к у
к   с т а н д а р т н о м у   в и д у   —   у д а л и т ь   л и ш н и е   с и м в о л ы ,   п р и в е с т и   в с е   к
н и ж н е м у   р е г и с т р у )
*/
$a = "A roza upala na lapu Azora";
$b = str_replace(" ", "", $a);
$c = strrev($b);
echo $b . "<br />";
echo $c;
if ($b == $c) {
    echo "Палиндром";
} else {
    echo "error";//это отывет
}
?>


<h3>Задача 34</h3>
<?php
/*  Н а р и с у й т е   п и р а м и д у ,   к а к   п о к а з а н о   н а
р и с у н к е ,   т о л ь к о   у в а ш е й   п и р а м и д ы   д о л ж н о
 б ы т ь   9   р я д о в ,   а   н е   5 .   Р е ш и т е   з а д а ч у   с
п о м о щ ь ю   о д н о г о   ц и к л а   и   ф у н к ц и и   s t r _ r e p e a t
*/

$x = "x";
for ($i = 0; $i < 10; $i++) {
    $b = str_repeat($x, $i);
    echo $b . "<br />";
}
?>

<h3>Задача 35</h3>
<?php
/* Н а р и с у й т е   п и р а м и д у ,   к а к   п о к а з а н о   н а   р и с у н к е ,   т о л ь к о   у
в а ш е й   п и р а м и д ы   д о л ж н о   б ы т ь   9   р я д о в ,   а   н е   5 .   Р е ш и т е   з а д а ч у   с
п о м о щ ь ю   о д н о г о   ц и к л а   и   ф у н к ц и и   s t r _ r e p e a t .

1
2 2
3 3 3
4 4 4 4
5 5 5 5 5
*/
$x = 1;
for ($i = 0; $i < 10; $i++) {
    $b = str_repeat($c, $i);
    $c = $i + 1;
    echo $b . "<br />";
}


?>










