<h1>Работа с %</h1>
<h3>Задача 1</h3>
<?php
/* Д а н ы   п е р е м е н н ы е   $ a   =   1 0   и   $ b   =   3 .   Н а й д и т е   о с т а т о к   о т
д е л е н и я   $ a   н а   $ b
*/
$a = 10;
$b = 3;
$c = $a % $b;
echo $c;
?>

<h3>Задача 2</h3>
<?php
/* Д а н ы   п е р е м е н н ы е   $ a   и   $ b .   П р о в е р ь т е ,   ч т о   $ a   д е л и т с я   б е з
о с т а т к а   н а   $ b .   Е с л и   э т о   т а к   —   в ы в е д и т е   ' Д е л и т с я '   и   р е з у л ь т а т
д е л е н и я ,   и н а ч е   в ы в е д и т е   ' Д е л и т с я   с   о с т а т к о м '   и   о с т а т о к   о т
д е л е н и я
*/
$a = 6;
$b = 2;

if ($a % $b == 0) {
    echo "Делится";
} else {
    echo "Делится с остатком";
}
?>

<h1>Работа с модулем</h1>
<h3>Задача 3</h3>
<?php
/* Д а н ы   п е р е м е н н ы е   $ a   и   $ b .   Н а й д и т е   м о д у л ь   р а з н о с т и   $ a
и   $ b .   П р о в е р ь т е   р а б о т у   с к р и п т а   с а м о с т о я т е л ь н о   д л я   р а з л и ч н ы х   $ a
и   $ b .
*/
$a = 6;
$b = 3;
$c = abs($a);

echo $c;
?>

<h3>Задача 4</h3>
<?php

/*
 Д а н ы   п е р е м е н н ы е   $ a   и   $ b .   О т н и м и т е   о т   $ a   п е р е м е н н у ю   $ b   и
р е з у л ь т а т   п р и с в о й т е   п е р е м е н н о й   $ c .   С д е л а й т е   т а к ,   ч т о б ы   в   л ю б о м
с л у ч а е   в   п е р е м е н н у ю   $ c   з а п и с а л о с ь   п о л о ж и т е л ь н о е   з н а ч е н и е .
П р о в е р ь т е   р а б о т у   с к р и п т а   п р и   $ a   и   $ b ,   р а в н ы х   с о о т в е т с т в е н н о   3
и   5 ,   6   и   1 .
*/
$a = 3;
$b = 5;
$c = $a - $b;
echo abs($c);
?>

<h1>Работа с степенью и корнем</h1>
<h3>Задача 5</h3>
<?php
/* В о з в е д и т е   2   в   1 0   с т е п е н ь .   Р е з у л ь т а т   з а п и ш и т е   в   п е р е м е н н у ю
$ s t .
*/
$a = 2;
$b = 10;
$st = $a ** $b;
echo $st;
?>

<h3>Задача 6</h3>
<?php
//   Н а й д и т е   к в а д р а т н ы й   к о р е н ь   и з   2 4 5 .
$a = 245;
$sqrt = sqrt($a);
echo $sqrt;
?>

<h3>Задачa 7</h3>
<?php
/* Д а н   м а с с и в   с   э л е м е н т а м и   4 ,   2 ,   5 ,   1 9 ,   1 3 ,   0 ,   1 0 .   Н а й д и т е
к в а д р а т н ы й   к о р е н ь   и з   с у м м ы   к в а д р а т о в   е г о   э л е м е н т о в .   Д л я
р е ш е н и я   в о с п о л ь з у й т е с ь   ц и к л о м   f o r e a c h .
*/
$sum = 0;
$arr = ["4", "2", "5", "19", "13", "0", "10"];
foreach ($arr as $value) {
    $a = $value ** 2;
    $sum += $a;
    $b = sqrt($sum);

}
echo $b . "<br / >";
?>

<h3>Задача 8</h3>
<?php
/* Н а й д и т е   к в а д р а т н ы й   к о р е н ь   и з   3 7 9 .   Р е з у л ь т а т   о к р у г л и т е   д о
ц е л ы х ,   д о   д е с я т ы х ,   д о   с о т ы х .
*/
$a = 379;
$sqr = sqrt($a);
$b = round($sqr);
$b1 = round($sqr, 1);
$b2 = round($sqr, 2);
echo $b . "<br />"; //целые
echo $b1 . "<br />";//десятые
echo $b2 . "<br />";//сотые
?>

<h3>Задача 9</h3>
<?php
/*Н а й д и т е   к в а д р а т н ы й   к о р е н ь   и з   5 8 7 .   О к р у г л и т е   р е з у л ь т а т   в
б о л ь ш у ю   и   м е н ь ш у ю   с т о р о н у ,   з а п и ш и т е   р е з у л ь т а т ы   о к р у г л е н и я   в
а с с о ц и а т и в н ы й   м а с с и в   с   к л ю ч а м и   ' f l o o r '   и   ' c e i l ' .
*/
$a = 587;
$b = sqrt($a);
$arr = [];
$arr['floor'] = floor($b);
$arr['ceil'] = ceil($b);
print_r($arr);
?>

<h1>Р а б о т а с m i n и m a x</h1>
<h3>Задача 10</h3>
<?php
/* Д а н ы   ч и с л а   4 ,   ­ 2 ,   5 ,   1 9 ,   ­ 1 3 0 ,   0 ,   1 0 .   Н а й д и т е   м и н и м а л ь н о е
и   м а к с и м а л ь н о е   ч и с л о .
*/
$arr = ["4", "-2", "5", "19", "-130", "0", "10"];
$min = min($arr);
$max = max($arr);
echo $min . "<br />";
echo $max . "<br />";
?>

<h1>Р а б о т а с р а н д о м о м</h1>
<h3>Задача 11</h3>
<?php
/* В ы в е д и т е   н а   э к р а н   с л у ч а й н о е   ч и с л о   о т   1   д о   1 0 0
*/
$min = 1;
$max = 100;
$rand = rand($min, $max);
echo $rand;
?>

<h3>Задача 12</h3>
<?php
/* С д е л а й т е   т а к ,   ч т о б ы   к а ж д ы й   р а з   п р и   о б н о в л е н и и   с т р а н и ц ы   н а
э к р а н   в ы в о д и л а с ь   с л у ч а й н ы м   о б р а з о м   о д н а   и з   т р е х   к а р т и н о к .
*/
?>
<img src="smile_<?php echo rand(1, 3) ?>.gif"/>

<h3>Задача 13</h3>
<?php
/*З а п о л н и т е   м а с с и в   1 0 ­ ю   с л у ч а й н ы м и   ч и с л а м и .   ( П о д с к а з к а :
н у ж н о   в о с п о л ь з о в а т ь с я   ц и к л а м и   f o r   и л и   w h i l e ) .
*/
$arr = [];
for ($i = 0; $i < 11; $i++) {
    $arr[$i] = rand(1, 100);
}
print_r($arr);
?>

<h3>Задача 14</h3>
<?php
/*  Н а п и ш и т е   с к р и п т ,   к о т о р ы й   б у д е т   н а х о д и т ь   к о р н и   к в а д р а т н о г о
у р а в н е н и я .
*/


?>

<h3>Задача 15</h3>
<?php
/* Н а п и ш и т е   с к р и п т ,   к о т о р ы й       б у д е т   н а х о д и т ь   ф а к т о р и а л   ч и с л а .
Ф а к т о р и а л   —   э т о   п р о и з в е д е н и е   в с е х   ц е л ы х   ч и с е л ,   м е н ь ш е   д а н н о г о .
Н а п р и м е р ,   4 !   =   1 * 2 * 3 * 4   =   2
*/
//$f = 4;
//$res = gmp_fact($f);
//echo $res; //не работает
$start = 1;
$n = 4;
for ($i = 1; $i <= $n; $i++) {
    $start = $start * $i;
}
echo $start;
?>
<h3>Задача 16</h3>
<?php
/* Н а п и ш и т е   с к р и п т ,   к о т о р ы й   п р о в е р я е т ,   я в л я е т с я   л и   д а н н о е
ч и с л о   п р о с т ы м   ( п р о с т о е   ч и с л о   —   э т о   т о ,   к о т о р о е   д е л и т с я   т о л ь к о
н а   1   и   н а   с а м о   с е б я
*/
$n = 7;
for ($i = 1; $i <= $n; $i++) {
    if ($n % $i == 0 && $n / $n == 1) {
        $flag = true;
    } else {
        $flag = false;
    }
}
if ($flag) {
    echo "prost";
} else {
    echo "error";
}
?>



<h3>Задача 17</h3>
<?php
/*1 7 .   Д а н   м а с с и в   $ a r r .   Н а й д и т е   с р е д н е е   а р и ф м е т и ч е с к о е   е г о
э л е м е н т о в .   П о д с к а з к а :   к о л и ч е с т в о   э л е м е н т о в   м а с с и в а   м о ж н о
п о д с ч и т а т ь   ф у н к ц и е й   c o u n t .   П р о в е р ь т е   з а д а ч у   н а   м а с с и в е   с
э л е м е н т а м и   1 2 ,   1 5 ,   2 0 ,   2 5 ,   5 9 ,   7 9 .
/*

 */
$arr = ["12", "15", '20', "25", "59", "79"];
$b = array_sum($arr);

$c = count($arr);

$d = $b / $c;
echo $d;
?>

<h3>Задача 18</h3>
<?php
/* Н а п и ш и т е   с к р и п т ­ к а л ь к у л я т о р   е д и н о г о   н а л о г а .   Н а л о г
с ч и т а е т с я   т а к :   е с л и   в ы   з а р а б о т а л и   м е н е е ,   ч е м   с т а в к а   $ s t a v k a
э т о г о   н а л о г а ,   у м н о ж е н н а я   н а   3 0   —   т о   п л а т и т е   с т а в к у .   Е с л и   ж е   в ы
з а р а б о т а л и   б о л е е ,   ч е м   3 0 * $ s t a v k a ,   т о   п л а т и т е   н е   т о л ь к о   с т а в к у
н а л о г а ,   н о   и   5 %   о т   т о й   с у м м ы ,   н а   к о т о р у ю   в ы   п р е в ы с и л и
3 0 * $ s t a v k a .  */

$zar = 1000;
$stavka = 10;
$st = $stavka * 30;
if ($zar < $st) {
    echo "к оплате - " . $stavka;
} else {
    $rasn = $zar - $st;
    $vids = $rasn * 0.05;
    $a = $stavka + $vids;
    echo "Вы привысили лимит - " . $a;
}
?>


<h3>Задача 19</h3>
<?php
/* Н а п и ш и т е   с к р и п т ­ к а л ь к у л я т о р   о п л а т ы   з а   э л е к т р о э н е р г и ю .
С у м м а   с ч и т а е т с я   т а к :   е с л и   в ы   п о т р а т и л и   з а   м е с я ц   м е н е е   1 5 0
к и л о в а т т ,   т о   с у м м а   с ч и т а е т с я   п о   о д н о й   с т а в к е   $ s u m m 1   з а   1
к и л о в а т т ,   в с ё ,   ч т о   б о л ь ш е   1 5 0   и   м е н ь ш е   3 0 0   к и л о в а т т   с ч и т а е т с я
п о   с т а в к е   $ s u m m 2 ,   а   в с е   к и л о в а т т ы   п о с л е   3 0 0   —   п о   с т а в к е
$ s u m m 3 .
*/
$kv = 20;
$summ1 = 0.2;
$summ2 = 0.6;
$summ3 = 1.2;
if ($kv < 150) {
    $opl1 = $summ1 * $kv;
    echo "к оплaте - " . $opl1;
} elseif ($kv > 150 && $kv < 300) {
    $opl2 = $summ2 * $kv;
    echo "к оплaте - " . $opl2;
} elseif ($kv > 300) {
    $opl3 = $summ3 * $kv;
    echo "к оплaте - " . $opl3;
}
?>

<h3>Задача 20</h3>
<?php
/*  Н а п и ш и т е   с к р и п т ,   к о т о р ы й   н а й д е т   в с е   п р о с т ы е   ч и с л а   в
з а д а н н о м   п р о м е ж у т к е .   П р о в е р ь т е   е г о   р а б о т у   н а   п р о м е ж у т к е   о т   1
д о   1 0 0 0 .
*/
for ($i = 2; $i <= 1000; $i++) {
    $flag = true;
    for ($j = 2; $j < $i; $j++) {
        if ($i % $j == 0) {
            $flag = false;
        }
    }
    if ($flag) {
        echo $i . "-";
    }
}
?>

<h3>Задача 21</h3>
<?php
/*  Н а п и ш и т е   с к р и п т ,   к о т о р ы й   б у д е т   н а х о д и т ь   т р о й к и   ц е л ы х
ч и с е л ,   у д о в л е т в о р я ю щ и х   т е о р е м е   П и ф а г о р а .
*/
?>



