<h3>Задача 1</h3>
<?php

/* Дан массив с элементами "html","css","php","js","jq".
*C помощью цикла  foreach выведите эти слова в столбик.
*/
$arr = array("html", "css", "php", "js", "jq");
foreach ($arr as $value) {
    echo $value . "<br />";
}
?>
<h3>Задача 2 </h3>
<?php
/*Дан массив с элементами 1,20,15,17,24,35 C помощью цикла  foreach выведите сумму
* всех чисел. записать в переменную $result
*/
$result = 0;
$arr = [1, 20, 15, 17, 24, 35];
foreach ($arr as $value) {
    $result += $value;
    echo $result . "<br />";
}
echo "Сумма всех элементов массива \$arr = " . $result;
?>
<hr/>


<h3>Задача 3 </h3>
<?php
/*Дан массив с элементами 26","17","136","12","79","15 C помощью цикла  foreach выведите сумму
* квадратов всех чисел. записать в переменную $result
*/
$resul = 0;
$arr = ["26", "17", "136", "12", "79", "15"];
foreach ($arr as $value1) {
    if (isset ($value1)) {
        $value1 = $value1 ** 2;

        $resul += $value1;
    }

}
echo "Сумма квадратов всех элементов массива \$arr = " . $resul;
?>

<hr/>
<h3>Задача 4</h3>
<?php
/*Дан массив $arr. С помощью первого цикла foreach
 выведите на экран столбец ключей, с помощью второго - столбец элементов
 */
$arr = ["green" => "зеленый", "red" => "красный", "blue" => "голубой"];
foreach ($arr as $one) {
    echo "Значения массива = " . $one . "<br />";
}

foreach ($arr as $key => $two) {
    echo "ключ массива = " . $key . "<br />";
}
?>
<hr/>
<h3>Задача 5</h3>
<?php
/* дан массив $arr с ключами "Коля","Вася","Петя" с элементами "200","300","400".
 * С помощью цикла Foreach выведите на экран столбец строк такого формата:
 *  "Коля - зарплата 200 дол.
*/
$arr = ["Коля" => "200", "Вася" => "300", "Петя" => 400];
foreach ($arr as $name => $dol) {
    echo $name . " - " . " зарплата " . $dol . " дол " . "<br />";
}
?>

<hr/>
<h3>Задача 6</h3>
<?php
/*Дан массив. С помощью цикла foreach запишите английский названия
 *в массив $en,  а русский  -  в массив $ua.
 */
$en = [];
$ua = [];
$arr = ["green" => "зеленый", "red" => "красный", "blue" => "голубой"];
foreach ($arr as $ene => $uau) {
    $en = $ene . "<br />";
    $ua = $uau . "<br />";
    echo "Массив en: ";
    print_r($en);
    echo "Массив ua: ";
    print_r($ua);
}
?>

<hr/>
<h3>Задача 7</h3>
<?php
/* Дан массив с элементами 2,5,9,15,0,4. С помощью цикла foreach
* и оператора if выведте на экран столбец тех элементов массива, которые
 * больше 3-х, но меньше 10.
 */
$arr = ["2", "5", "9", "15", "0", "4"];
foreach ($arr as $number) {
    if ($number > 3 && $number < 10) {
        echo $number . "<br />";
    }
}
?>
<hr/>
<h3>Задача 8</h3>
<?php
//дан массив ... . С помощью цикла foreach создайте строку -..-..-..-..-..-..-
$arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
foreach ($arr as $number) {
    echo "-" . $number; // Я думаю что задача не выполнена. Выводит -1-2-3-4-5-6-7-8-9  . нет последней "-".
}
echo "-";
?>
<h3>Задача 9</h3>
<?php
//Столбец чисел от одного до 100
for ($i = 1; $i <= 100; $i++) {
    echo $i . "<br />";
}
?>
<h3>Задача 10</h3>
<?php
//Столбец чисел от 11 до 33
for ($i = 11; $i <= 33; $i++) {
    echo $i . "<br />";
}
?>
<h3>Задача 11</h3>
<?php
// Вивести столбец четных чисел в промежутке от нуля до 100
for ($i = 0; $i <= 100; $i++) {
    if ($i % 2 == 0) {
        echo $i . "<br />";
    }
}
?>
<h3>Задача 12</h3>
<?php // просто в подчетах у меня ответ 5, а тут получается 4.
$n = 1000;
$i = 0;
while ($n > 50) {
    $n = $n / 2;
    echo "Переменная \$n = " . $n. "<br />";

    if ($n < 50) {
        break;
    }
    $i++;
    echo $i . "<br />";
}
?>


<h3>Задача 13</h3>
<?php
/*дан массив с элементами 4,2,5,19,13,0,10.С помощью цикла
*foreach и оператора if выведите на экран столбец тех элементов массива,
*которые больше 3-х, но меньше 10
 */
$arr = ["4", "2", "5", "19", "13", "0", "10"];
foreach ($arr as $number) {
    if ($number > 3 && $number < 10) {
        echo $number . "<br />";
    }
}
?>
<h3>Задача 14</h3>
<?php
/*дан массив с элементами 4,2,5,19,13,0,10.С помощью цикла
*foreach и оператора if проверьте есть ли в массиве элемент "е",
 * равном 2,3,4. если есть - выведите на экран "Есть", иначе нет.
 *
 */
$e = 2;
$arr = ["4", "2", "5", "19", "13", "0", "10"];
$in = in_array($e, $arr);
if ($in) {
    echo "Есть!";
} else {
    echo "Нет!";
}
?>

<h3>Задача 14,1</h3>
<?php
$e= 2;

$arr = ["4", "2", "5", "19", "13", "0", "10"];
foreach ($arr as $value) {
    $a = in_array($e, $arr);
}
if ($a){
    echo "Есть";
}else{
    echo "НЕт";
}
?>

<h3>Задача 15</h3>
<?php
//Дан Массив. посчитать колво элементов массива.
$arr = ["4", "2", "5", "19", "13", "0", "10"];
$count = count($arr);
echo $count;
?>
<h3>Задача 16</h3>
<?php
//дан массив 1,2,3,4,5,6,7,8,9. Используя foreach и if вывести на экран 123 456 789
$arr = ["1", "2", "3", "4", "5", "6", "7", "8", "9"];
foreach ($arr as $number) {
    if ($number % 3 == 0) {
        echo $number . "<br />";
    } else {
        echo $number . ",";
    }
}
?>

<h3>Задача 17</h3>
<?php
/*Составить массив месяцев. С помощью цикла foreach выведите
все месяцы, а текуций месяц вывкдите жирным. Текущий месяц должен хранить в
 переменной $month
 */
$month = 7;
$arr = [
    "January", "February", "March", "April", "May", "June", "July",
    "August", "September", "October", "November", "December"
];
foreach ($arr as $key => $value) {
    if ($key == $month) {
        echo "<b>" . $value . "<br />" . "</b>";
    } else {
        echo $value . "<br />";
    }
}
?>
<hr/>
<h3>Задача 18</h3>
<?php
/*создать массив дней недели. С помощью цикла foreach выведите
все дни недели, выходные дни следует вывести жирным
*/
$day1 = 5;
$day2 = 6;
$arr = ["Понедельник", "Вторник", "Среда", "Четверг",
        "Пятница", "Суббота", "Воскресенье"
];
foreach ($arr as $key => $day) {
    if ($key == $day1) {
        echo "<strong>" . $day . "<br />" . "</strong>";
    } elseif ($key == $day2) {
        echo "<strong>" . $day . "<br />" . "</strong>";
    } else {
        echo $day . "<br />";
    }
}
?>
<hr/>
<h3>Задача 19</h3>
<?php
//Создать массив дней. С помощью цкла  foreach  выведите все дни недели,
//а текущий день выведите курсивом. Текущий день должен храниться в переменной day
$day1 = 3;
$arr = ["Понедельник", "Вторник", "Среда", "Четверг",
        "Пятница", "Суббота", "Воскресенье"
];
foreach ($arr as $key => $day) {
    if ($key == $day1) {
        echo "<i>" . $day . "<br />" . "</i>";
    } else {
        echo $day . "<br />";
    }
}
?>

<hr>
<h3>Задача 20 </h3>
<?php
/*20. Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть
20 рядов, а не 5.

x
xx
xxx
xxxx
xxxxx
  */
$x = "x";
for ($i = 1; $i < 20; $i++) {
    if ($i == 1) {
        echo $x . "<br />";
    }
    for ($j = 0; $j <= $i; $j++) {

        echo $x;
    }
    echo "<br />";
}

?>


<hr>
<h3>Задача 21 </h3>
<?php
/* 21. Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть
9 рядов, а не 5.
1
22
333
4444
55555
*/
for ($i = 1; $i < 9; $i++) {
    if ($i == 1) {
        echo "1" . "<br />";
    }
    for ($j = 0; $j <= $i; $j++) {
        $s = $i + 1;
        echo $s;
    }
    echo "<br />";
}
?>


<h3>Задача 22 </h3>
<?php
/*22. Нарисуйте пирамиду, как показано на рисунке, воспользовавшись циклом for или while.

xx
xxxx
xxxxxx
xxxxxxxx
xxxxxxxxxx
*/
$x = "x";
for ($i = 1; $i < 5; $i++) {
    if ($i == 1) {
        echo $x . $x . "<br />";
    }
    for ($j = 0; $j <= $i; $j++) {

        echo $x . $x;
    }
    echo "<br />";
}

?>


<h3>Таблица умножения</h3>
<table border="2">
    <?php
    for ($i = 1; $i < 10; $i++) {
        echo "<tr>";
        for ($j = 2; $j < 10; $j++) {

            $k = $i * $j;
            echo "<td> $i * $j = $k</td>";

        }
        echo "</tr>";
    }
    ?>
</table>